app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "joysi"], ["text", "pppppp"], ["created_at", "2024-11-11 16:40:24.055337"], ["updated_at", "2024-11-11 16:40:24.055337"], ["user_id", 1]]
---
    def create
        @article = current_user.articles.build(article_params)
        if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
   def destroy
            @article = Article.find(params[:id])

            # Verifica que el usuario autenticado sea el propietario del artículo
            if @article.user == current_user
              @article.destroy