app/controllers/comments_controller.rb

INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["commenter", nil], ["body", "liiyiyiy"], ["article_id", 9], ["created_at", "2024-11-12 01:26:21.619387"], ["updated_at", "2024-11-12 01:26:21.619387"], ["user_id", 1]]
---
    def create
        @comment = @article.comments.create(comment_params.merge(user: current_user))

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_article
        @article = Article.find(params[:article_id])

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 9], ["id", 1], ["LIMIT", 1]]
---
    def set_comment
        @comment = @article.comments.find(params[:id])